app/Controllers/Master/AsetController.php

    public function index()
    {
        $search = $this->request->getGet('q');
        $status = $this->request->getGet('status');
        $kategori = $this->request->getGet('kategori_id');

        $builder = db_connect()->table('aset_all_uir a');

        if (!empty($search)) {
            $builder->groupStart()
                ->like('a.nama_aset', $search)
                ->orLike('a.all_id', $search)
                ->orLike('a.nomor_aset_baru', $search)
                ->orLike('a.nomor_aset_lama', $search)
                ->groupEnd();
        }

        if (!empty($status)) {
            $builder->where('a.status_aset', $status);
        }

        if (!empty($kategori)) {
            $builder->where('a.kategori_id', $kategori);
        }

        $total = $builder->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `aset_all_uir` `a`
WHERE `a`.`deleted_at` IS NULL

    public function new()
    {
        $kategoriId = (int) $this->request->getGet('kategori_id');
        $subKategoriId = (int) $this->request->getGet('sub_kategori_id');

        $data = [
            'title' => 'Registrasi Aset Baru',
            'record' => null,
            'kategori' => $this->kategoriModel->where('is_active', 1)->orderBy('nama_kategori', 'ASC')->findAll(),
            'subKategori' => $kategoriId ? $this->subKategoriModel->where('kategori_id', $kategoriId)->where('is_active', 1)->orderBy('nama_sub_kategori', 'ASC')->findAll() : [],
            'golongan' => $kategoriId ? $this->golonganModel->getByKategoriId($kategoriId) : [],
            'merk' => $this->merkModel->where('is_active', 1)->orderBy('nama_merk', 'ASC')->findAll(),
            'type' => [],
            'kondisi' => $this->kondisiModel->where('is_active', 1)->orderBy('level_kondisi', 'ASC')->findAll(),
            'sumberDana' => $this->sumberDanaModel->where('is_active', 1)->orderBy('nama_sumber_dana', 'ASC')->findAll(),
            'unitKerja' => $this->unitKerjaModel->getActiveOptions(),
            'subUnit' => [],
            'ruangan' => [],
            'selectedKategoriId' => $kategoriId,
            'selectedSubKategoriId' => $subKategoriId,
        ];
---
SELECT *
FROM `aset_kategori`
WHERE `is_active` = 1
AND `aset_kategori`.`deleted_at` IS NULL
ORDER BY `nama_kategori` ASC
SELECT *
FROM `aset_sumber_dana`
WHERE `is_active` = 1
ORDER BY `nama_sumber_dana` ASC
SELECT *
FROM `aset_merk`
WHERE `is_active` = 1
ORDER BY `nama_merk` ASC