app/Controllers/Master/BulkAsetController.php

    public function new()
    {
        $kategoriId = (int) ($this->request->getGet('kategori_id') ?? 0);
        $subKategoriId = (int) ($this->request->getGet('sub_kategori_id') ?? 0);

        $data = [
            'title' => 'Registrasi Aset Massal (Bulk)',
            'kategori' => $this->kategoriModel->where('is_active', 1)->orderBy('nama_kategori', 'ASC')->findAll(),
            'subKategori' => $kategoriId ? $this->subKategoriModel->where('kategori_id', $kategoriId)->where('is_active', 1)->orderBy('nama_sub_kategori', 'ASC')->findAll() : [],
            'golongan' => $kategoriId ? $this->golonganModel->getByKategoriId($kategoriId) : [],
            'merk' => $this->merkModel->where('is_active', 1)->orderBy('nama_merk', 'ASC')->findAll(),
            'type' => [],
            'kondisi' => $this->kondisiModel->where('is_active', 1)->orderBy('level_kondisi', 'ASC')->findAll(),
            'sumberDana' => $this->sumberDanaModel->where('is_active', 1)->orderBy('nama_sumber_dana', 'ASC')->findAll(),
---
SELECT *
FROM `aset_kategori`
WHERE `is_active` = 1
AND `aset_kategori`.`deleted_at` IS NULL
ORDER BY `nama_kategori` ASC
SELECT *
FROM `aset_merk`
WHERE `is_active` = 1
ORDER BY `nama_merk` ASC
SELECT *
FROM `aset_sumber_dana`
WHERE `is_active` = 1
ORDER BY `nama_sumber_dana` ASC