app/Controllers/Master/GedungController.php

SELECT COUNT(*) AS `numrows`
FROM `aset_gedung`
LEFT JOIN `tbl_unit_kerja` ON `tbl_unit_kerja`.`id_unit_kerja` = `aset_gedung`.`unit_kerja_id`
WHERE `aset_gedung`.`is_active` = 1
SELECT `aset_gedung`.*, `tbl_unit_kerja`.`nama_unit`
FROM `aset_gedung`
LEFT JOIN `tbl_unit_kerja` ON `tbl_unit_kerja`.`id_unit_kerja` = `aset_gedung`.`unit_kerja_id`
WHERE `aset_gedung`.`is_active` = 1
ORDER BY `tbl_unit_kerja`.`nama_unit` ASC, `aset_gedung`.`nama_gedung` ASC
 LIMIT 20
---
    private function getGedungData(int $perPage, int $page, array $params): array
    {
        $offset = ($page - 1) * $perPage;
        $builder = $this->gedungModel->builder();

        $builder->select('aset_gedung.*, tbl_unit_kerja.nama_unit')
            ->join('tbl_unit_kerja', 'tbl_unit_kerja.id_unit_kerja = aset_gedung.unit_kerja_id', 'left');

        if (!empty($params['q'])) {
            $builder->groupStart();
            $builder->orLike('aset_gedung.kode_gedung', $params['q'], 'both');
            $builder->orLike('aset_gedung.nama_gedung', $params['q'], 'both');
            $builder->orLike('tbl_unit_kerja.nama_unit', $params['q'], 'both');
            $builder->groupEnd();
        }

        if (!empty($params['unit_kerja_id'])) {
            $builder->where('aset_gedung.unit_kerja_id', $params['unit_kerja_id']);
        }

        if (isset($params['is_active'])) {
            $builder->where('aset_gedung.is_active', $params['is_active']);
        } else {
            $builder->where('aset_gedung.is_active', 1);
        }

        $total = $builder->countAllResults(false);
        $records = $builder->orderBy('tbl_unit_kerja.nama_unit', 'ASC')
            ->orderBy('aset_gedung.nama_gedung', 'ASC')
            ->get($perPage, $offset)
            ->getResultArray();