app/Controllers/Master/KategoriController.php

SELECT COUNT(*) AS `numrows`
FROM `aset_kategori`
WHERE `aset_kategori`.`is_active` = 1
SELECT *
FROM `aset_kategori`
WHERE `aset_kategori`.`is_active` = 1
ORDER BY `aset_kategori`.`kode_kategori` ASC
 LIMIT 20
---
    protected function getData(int $perPage, int $page, array $params): array
    {
        $builder = $this->kategoriModel->builder();
        $searchFields = ['aset_kategori.kode_kategori', 'aset_kategori.nama_kategori'];
        $this->applySearchFilters($builder, $searchFields, $params);

        if (!empty($params['jenis_aset'])) {
            $builder->where('aset_kategori.jenis_aset', $params['jenis_aset']);
        }

        if (!isset($params['is_active'])) {
            $builder->where('aset_kategori.is_active', 1);
        }

        $total = $builder->countAllResults(false);
        $records = $builder->orderBy('aset_kategori.kode_kategori', 'ASC')
            ->get($perPage, ($page - 1) * $perPage)
            ->getResultArray();