app/Controllers/Master/KondisiBarangController.php

SELECT COUNT(*) AS `numrows`
FROM `aset_kondisi_barang`
WHERE `aset_kondisi_barang`.`is_active` = 1
SELECT *
FROM `aset_kondisi_barang`
WHERE `aset_kondisi_barang`.`is_active` = 1
ORDER BY `aset_kondisi_barang`.`level_kondisi` ASC
 LIMIT 20
---
    protected function getData(int $perPage, int $page, array $params): array
    {
        $builder = $this->model->builder();
        $searchFields = ['aset_kondisi_barang.kode_kondisi', 'aset_kondisi_barang.nama_kondisi'];
        $this->applySearchFilters($builder, $searchFields, $params);

        if (!isset($params['is_active'])) {
            $builder->where('aset_kondisi_barang.is_active', 1);
        }

        $total = $builder->countAllResults(false);
        $records = $builder->orderBy('aset_kondisi_barang.level_kondisi', 'ASC')
            ->get($perPage, ($page - 1) * $perPage)
            ->getResultArray();