app/Controllers/Master/LantaiController.php

    private function getLantaiData(int $perPage, int $page, array $params): array
    {
        $offset = ($page - 1) * $perPage;
        $builder = $this->model->builder();

        $builder->select('aset_lantai.*, aset_gedung.nama_gedung, aset_gedung.kode_gedung, tbl_unit_kerja.nama_unit as unit_nama')
            ->join('aset_gedung', 'aset_gedung.gd_id = aset_lantai.gedung_id', 'left')
            ->join('tbl_unit_kerja', 'tbl_unit_kerja.id_unit_kerja = aset_gedung.unit_kerja_id', 'left');

        if (!empty($params['q'])) {
            $builder->groupStart();
            $builder->orLike('aset_lantai.kode_lantai', $params['q'], 'both');
            $builder->orLike('aset_lantai.nama_lantai', $params['q'], 'both');
            $builder->orLike('aset_gedung.nama_gedung', $params['q'], 'both');
            $builder->groupEnd();
        }

        if (!empty($params['gedung_id'])) {
            $builder->where('aset_lantai.gedung_id', $params['gedung_id']);
        }

        if (isset($params['is_active'])) {
            $builder->where('aset_lantai.is_active', $params['is_active']);
        } else {
            $builder->where('aset_lantai.is_active', 1);
        }

        $total = $builder->countAllResults(false);
        $records = $builder->orderBy('aset_gedung.nama_gedung', 'ASC')
            ->orderBy('aset_lantai.nomor_lantai', 'ASC')
            ->get($perPage, $offset)
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `aset_lantai`
LEFT JOIN `aset_gedung` ON `aset_gedung`.`gd_id` = `aset_lantai`.`gedung_id`
LEFT JOIN `tbl_unit_kerja` ON `tbl_unit_kerja`.`id_unit_kerja` = `aset_gedung`.`unit_kerja_id`
WHERE `aset_lantai`.`is_active` = 1
SELECT `aset_lantai`.*, `aset_gedung`.`nama_gedung`, `aset_gedung`.`kode_gedung`, `tbl_unit_kerja`.`nama_unit` as `unit_nama`
FROM `aset_lantai`
LEFT JOIN `aset_gedung` ON `aset_gedung`.`gd_id` = `aset_lantai`.`gedung_id`
LEFT JOIN `tbl_unit_kerja` ON `tbl_unit_kerja`.`id_unit_kerja` = `aset_gedung`.`unit_kerja_id`
WHERE `aset_lantai`.`is_active` = 1
ORDER BY `aset_gedung`.`nama_gedung` ASC, `aset_lantai`.`nomor_lantai` ASC
 LIMIT 20

    public function getFilterOptions(): array
    {
        return [
            'gedung' => $this->gedungModel->where('is_active', 1)->orderBy('nama_gedung', 'ASC')->findAll()
        ];
---
SELECT *
FROM `aset_gedung`
WHERE `is_active` = 1
AND `aset_gedung`.`deleted_at` IS NULL
ORDER BY `nama_gedung` ASC