app/Controllers/Master/PenanggungJawabController.php

SELECT COUNT(*) AS `numrows`
FROM `ylpi_karyawan`
WHERE `flag_karyawan` = '1'
SELECT `id_kpe`, `npk`, `nama_gelar`, `unit_kerja`, `kategori`, `email`
FROM `ylpi_karyawan`
WHERE `flag_karyawan` = '1'
ORDER BY `nama_gelar` ASC
 LIMIT 20
---
    public function index()
    {
        $search = $this->request->getGet('q');
        $db = db_connect();

        $builder = $db->table('ylpi_karyawan');

        if (!empty($search)) {
            $builder->groupStart()
                ->like('nama_gelar', $search)
                ->orLike('npk', $search)
                ->orLike('email', $search)
                ->groupEnd();
        }

        $builder->where('flag_karyawan', '1');

        $perPage = 20;
        $total = $builder->countAllResults(false);

        $currentPage = (int) ($this->request->getGet('page') ?? 1);
        $currentPage = ($currentPage < 1) ? 1 : $currentPage;
        $offset = ($currentPage - 1) * $perPage;

        $records = $builder->select('id_kpe, npk, nama_gelar, unit_kerja, kategori, email')
                           ->limit($perPage, $offset)
                           ->orderBy('nama_gelar', 'ASC')
                           ->get()
                           ->getResultArray();