app/Controllers/Master/SubUnitController.php

SELECT COUNT(*) AS `numrows`
FROM `aset_sub_units`
LEFT JOIN `tbl_unit_kerja` ON `tbl_unit_kerja`.`id_unit_kerja` = `aset_sub_units`.`unit_kerja_id`
WHERE `aset_sub_units`.`is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `aset_sub_units`
LEFT JOIN `tbl_unit_kerja` ON `tbl_unit_kerja`.`id_unit_kerja` = `aset_sub_units`.`unit_kerja_id`
WHERE `aset_sub_units`.`is_active` = 1
AND `aset_sub_units`.`deleted_at` IS NULL
SELECT `aset_sub_units`.*, `tbl_unit_kerja`.`nama_unit` as `unit_nama`
FROM `aset_sub_units`
LEFT JOIN `tbl_unit_kerja` ON `tbl_unit_kerja`.`id_unit_kerja` = `aset_sub_units`.`unit_kerja_id`
WHERE `aset_sub_units`.`is_active` = 1
AND `aset_sub_units`.`deleted_at` IS NULL
ORDER BY `aset_sub_units`.`updated_at` DESC
 LIMIT 20
---
    private function getSubUnitData(int $perPage, int $page, array $params): array
    {
        $offset = ($page - 1) * $perPage;
        $builder = $this->subUnitModel->builder();

        $builder->select('aset_sub_units.*, tbl_unit_kerja.nama_unit as unit_nama')
            ->join('tbl_unit_kerja', 'tbl_unit_kerja.id_unit_kerja = aset_sub_units.unit_kerja_id', 'left');

        if (!empty($params['q'])) {
            $builder->groupStart();
            $builder->orLike('aset_sub_units.kode_sub_unit', $params['q'], 'both');
            $builder->orLike('aset_sub_units.nama_sub_unit', $params['q'], 'both');
            $builder->orLike('tbl_unit_kerja.nama_unit', $params['q'], 'both');
            $builder->groupEnd();
        }

        if (!empty($params['unit_kerja_id'])) {
            $builder->where('aset_sub_units.unit_kerja_id', $params['unit_kerja_id']);
        }

        if (isset($params['is_active'])) {
            $builder->where('aset_sub_units.is_active', $params['is_active']);
        } else {
            $builder->where('aset_sub_units.is_active', 1);
        }

        $total = $builder->countAllResults(false);
        $records = $builder->orderBy('tbl_unit_kerja.nama_unit', 'ASC')
            ->orderBy('aset_sub_units.nama_sub_unit', 'ASC')
            ->get($perPage, $offset)
            ->getResultArray();