app/Controllers/Master/UnitKerjaController.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_unit_kerja`
WHERE `flag_aktif` = 1
SELECT *
FROM `tbl_unit_kerja`
WHERE `flag_aktif` = 1
ORDER BY `nama_unit` ASC
 LIMIT 20
---
    public function index()
    {
        $search = $this->request->getGet('q');

        $builder = db_connect()->table('tbl_unit_kerja')->where('flag_aktif', 1);

        if (!empty($search)) {
            $builder->groupStart()
                ->like('nama_unit', $search)
                ->orLike('id_unit_kerja', $search)
                ->groupEnd();
        }

        $total = $builder->countAllResults(false);
        $perPage = 20;
        $currentPage = (int) ($this->request->getGet('page') ?? 1);
        $currentPage = ($currentPage < 1) ? 1 : $currentPage;
        $offset = ($currentPage - 1) * $perPage;

        $totalPages = $total > 0 ? ceil($total / $perPage) : 1;

        $data = [
            'title' => 'Referensi Unit Kerja',
            'unitKerja' => $builder->limit($perPage, $offset)->orderBy('nama_unit', 'ASC')->get()->getResultArray(),