app/Controllers/Auth/LoginController.php

    public function attemptLogin()
    {
        // Check for too many login attempts from this IP
        $ipAddress = $this->request->getIPAddress();
        if ($this->isTooManyAttempts($ipAddress)) {
            $this->session->setFlashdata('error', 'Terlalu banyak percobaan login. Silakan coba lagi nanti.');
            return redirect()->to('/auth/login');
        }

        // Validate input
        $rules = [
            'username' => 'required|trim|min_length[3]|max_length[50]',
            'password' => 'required|trim|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return view('auth/login', [
                'validation' => $this->validator
            ]);
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Find user by username and active status
        $user = $this->userModel
            ->where('username', $username)
            ->where('is_active', 1)
            ->first();
---
SELECT *
FROM `sys_users`
WHERE `username` = 'admin'
AND `is_active` = 1
AND `sys_users`.`deleted_at` IS NULL
 LIMIT 1

    private function isTooManyAttempts(string $ipAddress): bool
    {
        $db = db_connect();
        $builder = $db->table('sys_login_attempts');

        // Check failed attempts in last 15 minutes
        $limit = 5; // Max attempts
        $timeWindow = 15 * 60; // 15 minutes in seconds

        $attempts = $builder
            ->where('ip_address', $ipAddress)
            ->where('is_success', 0)
            ->where('attempt_time >=', date('Y-m-d H:i:s', time() - $timeWindow))
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `sys_login_attempts`
WHERE `ip_address` = '::1'
AND `is_success` = 0
AND `attempt_time` >= '2026-05-06 22:50:46'

    private function logLoginAttempt(?int $userId, bool $success): void
    {
        $db = db_connect();
        $builder = $db->table('sys_login_attempts');

        $builder->insert([
            'user_id'      => $userId,
            'ip_address'   => $this->request->getIPAddress(),
            'attempt_time' => date('Y-m-d H:i:s'),
            'is_success'   => $success ? 1 : 0,
        ]);
---
INSERT INTO `sys_login_attempts` (`user_id`, `ip_address`, `attempt_time`, `is_success`) VALUES (1, '::1', '2026-05-06 23:05:46', 1)