app/Models/Reference/UnitKerjaReadOnlyModel.php

    public function getActiveOptions(): array
    {
        return $this->where('flag_aktif', 1)
                     ->orderBy('nama_unit', 'ASC')
                     ->findAll();
---
SELECT *
FROM `tbl_unit_kerja`
WHERE `flag_aktif` = 1
ORDER BY `nama_unit` ASC