app/Models/Reference/UnitKerjaAllowedModel.php

SELECT *
FROM `vw_unit_kerja_allowed`
ORDER BY `nama_unit` ASC
---
    public function getActiveOptions(): array
    {
        return $this->orderBy('nama_unit', 'ASC')->findAll();