app/Controllers/Setting/UnitKerjaAllowedController.php

SELECT `r`.`role_code`
FROM `sys_roles` `r`
JOIN `sys_user_roles` `ur` ON `ur`.`role_id` = `r`.`id`
WHERE `ur`.`user_id` = '1'
AND `ur`.`is_active` = 1
---
    protected function isAdmin(): bool
    {
        if (!session()->has('user_id')) {
            log_message('warning', 'isAdmin: no user_id in session');
            return false;
        }

        $userId = session('user_id');
        $db = db_connect();
        $role = $db->table('sys_roles r')
            ->select('r.role_code')
            ->join('sys_user_roles ur', 'ur.role_id = r.id')
            ->where('ur.user_id', $userId)
            ->where('ur.is_active', 1)
            ->get()
            ->getRowArray();

SELECT *
FROM `tbl_unit_kerja`
WHERE `flag_aktif` = 1
ORDER BY `id_unit_kerja` ASC
---
    public function index()
    {
        if (!$this->isAdmin()) {
            return redirect()->to('/admin/dashboard')
                ->with('error', 'Anda tidak memiliki izin untuk mengakses halaman ini.');
        }

        $allUnits = $this->unitKerjaModel->where('flag_aktif', 1)
            ->orderBy('id_unit_kerja', 'ASC')
            ->findAll();