app/Controllers/DashboardController.php

    public function index()
    {
        $unitKerjaModel = new UnitKerjaReadOnlyModel();
        $subUnitModel = new SubUnitModel();
        $gedungModel = new GedungModel();
        $ruanganModel = new RuanganModel();

        $totalUnitKerja = $unitKerjaModel->where('flag_aktif', 1)->countAllResults();
        $totalSubUnit = $subUnitModel->where('is_active', 1)->countAllResults();
        $totalGedung = $gedungModel->where('is_active', 1)->countAllResults();
        $totalRuangan = $ruanganModel->where('is_active', 1)->countAllResults();

        $latestRuangan = $ruanganModel->select('aset_ruangan.*,
                aset_lantai.nama_lantai,
                aset_gedung.nama_gedung,
                ylpi_karyawan.nama_gelar as pj_nama')
            ->join('aset_lantai', 'aset_lantai.lt_id = aset_ruangan.lantai_id', 'left')
            ->join('aset_gedung', 'aset_gedung.gd_id = aset_lantai.gedung_id', 'left')
            ->join('aset_sub_units', 'aset_sub_units.su_id = aset_ruangan.sub_unit_id', 'left')
            ->join('ylpi_karyawan', 'ylpi_karyawan.id_kpe = aset_ruangan.penanggung_jawab_id_kpe', 'left')
            ->orderBy('aset_ruangan.created_at', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_unit_kerja`
WHERE `flag_aktif` = 1
SELECT COUNT(*) AS `numrows`
FROM `aset_sub_units`
WHERE `is_active` = 1
AND `aset_sub_units`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `aset_gedung`
WHERE `is_active` = 1
AND `aset_gedung`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `aset_ruangan`
WHERE `is_active` = 1
AND `aset_ruangan`.`deleted_at` IS NULL
SELECT `aset_ruangan`.*, `aset_lantai`.`nama_lantai`, `aset_gedung`.`nama_gedung`, `ylpi_karyawan`.`nama_gelar` as `pj_nama`
FROM `aset_ruangan`
LEFT JOIN `aset_lantai` ON `aset_lantai`.`lt_id` = `aset_ruangan`.`lantai_id`
LEFT JOIN `aset_gedung` ON `aset_gedung`.`gd_id` = `aset_lantai`.`gedung_id`
LEFT JOIN `aset_sub_units` ON `aset_sub_units`.`su_id` = `aset_ruangan`.`sub_unit_id`
LEFT JOIN `ylpi_karyawan` ON `ylpi_karyawan`.`id_kpe` = `aset_ruangan`.`penanggung_jawab_id_kpe`
WHERE `aset_ruangan`.`deleted_at` IS NULL
ORDER BY `aset_ruangan`.`created_at` DESC
 LIMIT 5