app/Models/UserModel.php

SELECT `r`.`role_code`, `r`.`role_name`, `r`.`id` as `role_id`
FROM `sys_users` `u`
JOIN `sys_user_roles` `ur` ON `ur`.`user_id` = `u`.`id`
JOIN `sys_roles` `r` ON `r`.`id` = `ur`.`role_id`
WHERE `u`.`id` = 1
AND `r`.`is_active` = 1
AND `ur`.`is_active` = 1
---
    public function getUserRole(int $userId)
    {
        $builder = $this->db->table($this->table . ' u');
        $builder->select('r.role_code, r.role_name, r.id as role_id');
        $builder->join('sys_user_roles ur', 'ur.user_id = u.id');
        $builder->join('sys_roles r', 'r.id = ur.role_id');
        $builder->where('u.id', $userId);
        $builder->where('r.is_active', 1);
        $builder->where('ur.is_active', 1);

        return $builder->get()->getRow();

SELECT COUNT(*) AS `numrows`
FROM `sys_users`
WHERE `sys_users`.`deleted_at` IS NULL
SELECT `sys_users`.*
FROM `sys_users`
WHERE `sys_users`.`deleted_at` IS NULL
ORDER BY `sys_users`.`updated_at` DESC
 LIMIT 20
SELECT `r`.`id`, `r`.`role_code`, `r`.`role_name`
FROM `sys_roles` `r`
JOIN `sys_user_roles` `ur` ON `ur`.`role_id` = `r`.`id`
WHERE `ur`.`user_id` = '1'
AND `ur`.`is_active` = 1
AND `r`.`is_active` = 1
---
    public function getAllWithRoles(int $perPage = 20, int $page = 1, string $search = '')
    {
        $builder = $this->builder();
        $builder->select('sys_users.*');

        if (!empty($search)) {
            $builder->groupStart();
            $builder->like('sys_users.username', $search, 'both');
            $builder->orLike('sys_users.full_name', $search, 'both');
            $builder->orLike('sys_users.email', $search, 'both');
            $builder->groupEnd();
        }

        $builder->where('sys_users.deleted_at', null);

        $total = $builder->countAllResults(false);
        $users = $builder->orderBy('sys_users.updated_at', 'DESC')
            ->get($perPage, ($page - 1) * $perPage)
            ->getResultArray();

        $db = db_connect();
        foreach ($users as &$user) {
            $roles = $db->table('sys_roles r')
                ->select('r.id, r.role_code, r.role_name')
                ->join('sys_user_roles ur', 'ur.role_id = r.id')
                ->where('ur.user_id', $user['id'])
                ->where('ur.is_active', 1)
                ->where('r.is_active', 1)
                ->get()
                ->getResultArray();