app/Views/layouts/main.php

SELECT `r`.`role_code`
FROM `sys_roles` `r`
JOIN `sys_user_roles` `ur` ON `ur`.`role_id` = `r`.`id`
WHERE `ur`.`user_id` = '1'
AND `ur`.`is_active` = 1
---
                $userId = session('user_id');
                $isAdmin = false;
                if ($userId) {
                    $role = db_connect()->table('sys_roles r')
                        ->select('r.role_code')
                        ->join('sys_user_roles ur', 'ur.role_id = r.id')
                        ->where('ur.user_id', $userId)
                        ->where('ur.is_active', 1)
                        ->get()
                        ->getRowArray();